ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_hwsem.h
/* semaphore index */
typedef enum {
    SEM0 = 0U,                                                             /*!< semaphore 0 */
    SEM1,                                                                  /*!< semaphore 1 */
    SEM2,                                                                  /*!< semaphore 2 */
    SEM3,                                                                  /*!< semaphore 3 */
    SEM4,                                                                  /*!< semaphore 4 */
    SEM5,                                                                  /*!< semaphore 5 */
    SEM6,                                                                  /*!< semaphore 6 */
    SEM7,                                                                  /*!< semaphore 7 */
    SEM8,                                                                  /*!< semaphore 8 */
    SEM9,                                                                  /*!< semaphore 9 */
    SEM10,                                                                 /*!< semaphore 10 */
    SEM11,                                                                 /*!< semaphore 11 */
    SEM12,                                                                 /*!< semaphore 12 */
    SEM13,                                                                 /*!< semaphore 13 */
    SEM14,                                                                 /*!< semaphore 14 */
    SEM15,                                                                 /*!< semaphore 15 */
    SEM16,                                                                 /*!< semaphore 16 */
    SEM17,                                                                 /*!< semaphore 17 */
    SEM18,                                                                 /*!< semaphore 18 */
    SEM19,                                                                 /*!< semaphore 19 */
    SEM20,                                                                 /*!< semaphore 20 */
    SEM21,                                                                 /*!< semaphore 21 */
    SEM22,                                                                 /*!< semaphore 22 */
    SEM23,                                                                 /*!< semaphore 23 */
    SEM24,                                                                 /*!< semaphore 24 */
    SEM25,                                                                 /*!< semaphore 25 */
    SEM26,                                                                 /*!< semaphore 26 */
    SEM27,                                                                 /*!< semaphore 27 */
    SEM28,                                                                 /*!< semaphore 28 */
    SEM29,                                                                 /*!< semaphore 29 */
    SEM30,                                                                 /*!< semaphore 30 */
    SEM31                                                                  /*!< semaphore 31 */
} hwsem_semaphore_enum;

/* hwsem_ctlx register */
#define CTL_PID(regval)          (BITS(0,7) & ((uint32_t)(regval) << 0))   /*!< write value to HWSEM_CTL_PID bit field */
#define GET_CTL_PID(regval)      GET_BITS((regval),0,7)                    /*!< get value of HWSEM_CTL_PID bit field */
#define CTL_MID(regval)          (BITS(8,11) & ((uint32_t)(regval) << 8))  /*!< write value to HWSEM_CTL_MID bit field */
#define GET_CTL_MID(regval)      GET_BITS((regval),8,11)                   /*!< get value of HWSEM_CTL_MID bit field */
#define HWSEM_LOCK               HWSEM_CTL_LK                              /*!< HWSEM semaphore locked */

/* hwsem_unlk register */
#define UNLK_MID(regval)         (BITS(8,11) & ((uint32_t)(regval) << 8))  /*!< write value to HWSEM_CTL_PID bit field */
#define UNLK_KEY(regval)         (BITS(16,31) & ((uint32_t)(regval) << 16))/*!< write value to HWSEM_CTL_PID bit field */

/* hwsem_key register */
#define KEY_KEY(regval)          (BITS(16,31) & ((uint32_t)(regval) << 16))/*!< write value to HWSEM_CTL_PID bit field */
#define GET_KEY_KEY(regval)      GET_BITS((regval),16,31)                  /*!< get value of HWSEM_CTL_PID bit field */

/* AHB bus master ID */
#define HWSEM_MASTER_ID          0x0BU                                     /*!< core CM7 master ID */

/* function declarations */
/* lock & unlock functions */
/* try to lock the specific semaphore by writing process ID */
ErrStatus hwsem_lock_set(hwsem_semaphore_enum semaphore, uint8_t process);
/* try to release the lock of the semaphore by writing process ID */
ErrStatus hwsem_lock_release(hwsem_semaphore_enum semaphore, uint8_t process);
/* try to lock the semaphore by reading */
ErrStatus hwsem_lock_by_reading(hwsem_semaphore_enum semaphore);
/* unlock all semaphores of the master ID */
ErrStatus hwsem_unlock_all(uint16_t key);

/* others */
/* get process ID of the specific semaphore */
uint32_t hwsem_process_id_get(hwsem_semaphore_enum semaphore);
/* get master ID of the specific semaphore */
uint32_t hwsem_master_id_get(hwsem_semaphore_enum semaphore);
/* get the lock status of the semaphore */
FlagStatus hwsem_lock_status_get(hwsem_semaphore_enum semaphore);
/* set the key */
void hwsem_key_set(uint16_t key);
/* get the key */
uint16_t hwsem_key_get(void);

/* flag and interrupt functions */
/* get the HWSEM flag status */
FlagStatus hwsem_flag_get(hwsem_semaphore_enum semaphore);
/* clear HWSEM flag status */
void hwsem_flag_clear(hwsem_semaphore_enum semaphore);
/* get HWSEM interrupt flag status */
FlagStatus hwsem_interrupt_flag_get(hwsem_semaphore_enum semaphore);
/* clear HWSEM interrupt flag */
void hwsem_interrupt_flag_clear(hwsem_semaphore_enum semaphore);
/* enable HWSEM interrupt */
void hwsem_interrupt_enable(hwsem_semaphore_enum semaphore);
/* disable HWSEM interrupt */
void hwsem_interrupt_disable(hwsem_semaphore_enum semaphore);

#endif /* GD32H73X_75X_HWSEM_H */
